Revit 2026 API

# DimensionValueOverride Property

---

The text that replaces the segment's value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ValueOverride { get; set; }
```
```vb
Public Property ValueOverride As String
	Get
	Set
```
```cpp
public:
property String^ ValueOverride {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ValueOverride : string with get, set
```

#### Property Value

String

This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding properties of the DimensionSegment class.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace